Ran Plan for 2 projects:

1. dir: `vpc-demo-2` workspace: `default`
1. dir: `vpc-demo` workspace: `default`

### 1. dir: `vpc-demo-2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_subnet.private_subnets[0] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0e6a15c59a84d3160" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.11.4.0/24" -> "10.2.4.0/24" # forces replacement
      ~ id                                             = "subnet-0e6a15c59a84d3160" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-1"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[1] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0b0e9a50f14b91f2e" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.11.5.0/24" -> "10.2.5.0/24" # forces replacement
      ~ id                                             = "subnet-0b0e9a50f14b91f2e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-2"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.private_subnets[2] must be replaced
-/+ resource "aws_subnet" "private_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-00539da914257247b" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.11.6.0/24" -> "10.2.6.0/24" # forces replacement
      ~ id                                             = "subnet-00539da914257247b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Private Subnet Demo2-3"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[0] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0226499dd7c8abde8" -> (known after apply)
      ~ availability_zone_id                           = "use1-az1" -> (known after apply)
      ~ cidr_block                                     = "10.11.1.0/24" -> "10.2.1.0/24" # forces replacement
      ~ id                                             = "subnet-0226499dd7c8abde8" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-1"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[1] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-09b6273bcfee7c9cb" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ cidr_block                                     = "10.11.2.0/24" -> "10.2.2.0/24" # forces replacement
      ~ id                                             = "subnet-09b6273bcfee7c9cb" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-2"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.public_subnets[2] must be replaced
-/+ resource "aws_subnet" "public_subnets" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:630209571978:subnet/subnet-0c39d773d74df4fd4" -> (known after apply)
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.11.3.0/24" -> "10.2.3.0/24" # forces replacement
      ~ id                                             = "subnet-0c39d773d74df4fd4" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "630209571978" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "Public Subnet Demo2-3"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo-2`
</details>
Plan: 6 to add, 0 to change, 6 to destroy.

---
### 2. dir: `vpc-demo` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Project VPC IGW Demo"
        }
      + tags_all = {
          + "Name" = "Project VPC IGW Demo"
        }
      + vpc_id   = "vpc-038de61bc566c92be"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc-demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://180f-100-26-152-126.ngrok.io/lock?id=Pin-Cheng%252Faws-vpc%252Fvpc-demo%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc-demo`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`